tap "hashicorp/tap"
tap "oven-sh/bun"
# Official Amazon AWS command-line interface
brew "awscli"
# Powerful, clean, object-oriented scripting language
brew "git"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple Node.js versions
brew "nvm"
# Fast, disk space efficient package manager
brew "pnpm"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Terraform
brew "hashicorp/tap/terraform"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Allows connection to a computer remotely
cask "anydesk"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Collaborative team software
cask "figma"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Git client focusing on productivity
cask "gitkraken"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
