tap "oven-sh/bun"
# Node Version Manager for managing multiple Node.js versions
brew "nvm"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Fast, disk space efficient package manager
brew "pnpm"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Universal database tool and SQL client
cask "dbeaver-community"
# App to build and share containerised applications and microservices
cask "docker"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# All-in-one workspace for notes, tasks, wikis, and databases
cask "notion"
# Postman is a powerful API development environment that helps you create, test, and document APIs.
cask "postman"
# Monospaced font with programming ligatures designed by JetBrains
cask "font-jetbrains-mono"
# JetBrains Mono with added Nerd Font glyphs for terminal icons and powerline symbols
cask "font-jetbrains-mono-nerd-font"
# Open-source code editor developed by Microsoft with extensive language support and extensions
cask "visual-studio-code"
# High-performance, collaborative code editor written in Rust
cask "zed"
# Team communication and collaboration platform
cask "slack"
# Digital music streaming service
cask "spotify"
# Voice and text chat application for communities
cask "discord"
